Repository: nguyenduckhai2583/mealmate
Catalog: lib/l10n/app_*.arb
Languages: ja, vi

source: Home
ja: ホーム
vi: Trang chủ

# onboardingTitle1
source: Personalized Health Journey
ja: パーソナライズされた健康の旅
vi: Hành trình sức khỏe cá nhân

# onboardingDes1
source: Enter your weight, height, medical history, and goals to start your tailored health plan
ja: 体重、身長、病歴、目標を入力して、あなたに合わせた健康プランを始めましょう
vi: Nhập cân nặng, chiều cao, tiền sử bệnh và mục tiêu của bạn để bắt đầu kế hoạch sức khỏe phù hợp

# onboardingTitle2
source: Smart Food Choices
ja: スマートな食事の選択
vi: Lựa chọn thực phẩm thông minh

# onboardingDes2
source: Take or upload a photo of your food. Get personalized recommendations instantly
ja: 食事の写真を撮るかアップロードしましょう。個別の推奨を即座に受け取ります
vi: Chụp hoặc tải ảnh món ăn của bạn lên. Nhận khuyến nghị cá nhân hóa ngay lập tức

# onboardingTitle3
source: Achieve Your Health Goals
ja: 健康目標を達成する
vi: Đạt được mục tiêu sức khỏe của bạn

# onboardingDes3
source: Receive instant feedback on your food choices to help you stay on track
ja: 食事の選択について即座にフィードバックを受け取り、軌道に乗るのを助けます
vi: Nhận phản hồi ngay lập tức về lựa chọn thực phẩm của bạn để giúp bạn luôn đi đúng hướng

source: Skip
ja: スキップ
vi: Bỏ qua

source: Next
ja: 次へ
vi: Tiếp theo

source: Get Started
ja: 開始
vi: Bắt đầu

source: Male
ja: 男性
vi: Nam

source: Female
ja: 女性
vi: Nữ

source: Gender
ja: 性別
vi: Giới tính

source: Weight
ja: 体重
vi: Cân nặng

source: Age
ja: 年齢
vi: Tuổi

# whatYouLookLike
source: What do <primary>You</primary> look like?
ja: <primary>あなた</primary>はどのように見えますか？
vi: Bạn trông như thế nào?

# howTallAreYou
source: How <primary>Tall</primary> are you?
ja: あなたの<primary>身長</primary>は？
vi: Bạn cao bao nhiêu?

# whatYourGoal
source: What's your <primary>Goal?</primary>
ja: あなたの<primary>目標</primary>は何ですか？
vi: Mục tiêu của bạn là gì?

source: Not found?
ja: 見つかりませんか？
vi: Không tìm thấy?

source: Enter your goal
ja: 目標を入力してください
vi: Nhập mục tiêu của bạn

# doYouHaveAnyMedicalCondition
source: Do you have any <green>medical conditions</green> we should be aware of?
ja: 知っておくべき<green>病状</green>がありますか？
vi: Bạn có tình trạng y tế nào chúng tôi cần biết không?

source: Meals
ja: 食事
vi: Bữa ăn

source: Account
ja: アカウント
vi: Tài khoản

# unableAccessCamera
source: Camera Access Denied
ja: カメラのアクセスが拒否されました
vi: Từ chối truy cập máy ảnh

# enableCameraPermission
source: Allow the app to access the camera in Settings to enable it
ja: 設定でアプリがカメラにアクセスできるように許可してください
vi: Cho phép ứng dụng truy cập máy ảnh trong Cài đặt để tiếp tục

# unableAccessPhoto
source: Photo Access Denied
ja: 写真のアクセスが拒否されました
vi: Từ chối truy cập ảnh

# enablePhotoPermission
source: Allow the app to access the photos in Settings to enable it
ja: 設定でアプリが写真にアクセスできるように許可してください
vi: Cho phép ứng dụng truy cập ảnh trong Cài đặt để tiếp tục

source: Go to Setting
ja: 設定に移動
vi: Đi tới Cài đặt

source: Explanation
ja: 説明
vi: Giải thích

source: Height
ja: 身長
vi: Chiều cao

source: Goal
ja: 目標
vi: Mục tiêu

source: Medical Condition
ja: 病状
vi: Tình trạng y tế

# hello
source: Hello {name}
ja: こんにちは {name}
vi: Xin chào {name}

source: Meal Match
ja: 食事のマッチ
vi: Kiểm tra bữa ăn

# mealMatchDescription
source: Remember your goal Let's see if your meal suits you
ja: あなたの目標を覚えて\n食事が適しているか確認しましょう
vi: Nhớ mục tiêu của bạn Hãy xem bữa ăn của bạn có phù hợp không

# checkItNow
source: Check now
ja: 今すぐ確認
vi: Kiểm tra ngay

source: Recommended
ja: おすすめ
vi: Đề xuất

source: Meal Suggestion
ja: 食事の提案
vi: Gợi ý bữa ăn

# weWillPreparedForYou
source: We will prepare the best food for you
ja: 最高の食事を\n準備します
vi: Chúng tôi sẽ chuẩn bị thức ăn tốt nhất cho bạn

# weSuggestMealFromIngredient
source: We make sure it's perfect for you
ja: 完璧な食事を\n提案します
vi: Chúng tôi đảm bảo nó hoàn hảo cho bạn

source: Ingredient already?
ja: 既に材料がありますか？
vi: Đã có nguyên liệu?

source: Gallery
ja: ギャラリー
vi: Thư viện

source: Camera
ja: カメラ
vi: Máy ảnh

source: Breakfast
ja: 朝食
vi: Bữa sáng

source: Lunch
ja: 昼食
vi: Bữa trưa

source: Dinner
ja: 夕食
vi: Bữa tối

source: Can be use
ja: 使用できます
vi: Có thể sử dụng

# useButLimit
source: Can be used but limited
ja: 使用できますが制限があります
vi: Có thể sử dụng nhưng hạn chế

# cannotUse
source: Absolutely not to be used
ja: 絶対に使用しないでください
vi: Không được sử dụng

source: Suggestion
ja: 提案
vi: Gợi ý

source: Ingredients
ja: 材料
vi: Thành phần

source: Instruction
ja: 指示
vi: Hướng dẫn

source: Oops...
ja: おっと...

# somethingWrong
source: Sorry, something went wrong
ja: 申し訳ありませんが、問題が発生しました
vi: Xin lỗi, có điều gì đó không đúng

source: Cancel
ja: キャンセル
vi: Hủy bỏ

source: Language
ja: 言語
vi: Ngôn ngữ

source: Weight Loss
ja: 減量
vi: Giảm Cân

source: Muscle Gain
ja: 筋肉増強
vi: Tăng Cơ

source: Manage Diabetes
ja: 糖尿病管理
vi: Quản Lý Bệnh Tiểu Đường

# digestion
source: Improve Digestion
ja: 消化改善
vi: Cải Thiện Tiêu Hóa

source: Healthy Aging
ja: 健康的な老化
vi: Lão Hóa Khỏe Mạnh

source: Balanced Nutrition
ja: 栄養バランス
vi: Dinh Dưỡng Cân Bằng

source: Lower Cholesterol
ja: コレステロール低下
vi: Giảm Cholesterol

# healthPregnancy
source: Healthy Pregnancy
ja: 健康的な妊娠
vi: Thai Kỳ Khỏe Mạnh

# vegan
source: Vegetarian Nutrition
ja: ベジタリアン栄養
vi: Dinh Dưỡng Chay

# skinHealth
source: Improve Skin Health
ja: 肌の健康改善
vi: Cải Thiện Sức Khỏe Da

source: Reduce Stress
ja: ストレス軽減
vi: Giảm Căng Thẳng

source: Bone Health
ja: 骨の健康
vi: Sức Khỏe Xương

# sleepQuality
source: Improve Sleep Quality
ja: 睡眠の質向上
vi: Cải Thiện Giấc Ngủ

source: Diabetes
ja: 糖尿病
vi: Bệnh Tiểu Đường

source: Hypertension
ja: 高血圧
vi: Tăng Huyết Áp

# hearthDisease
source: Heart Disease
ja: 心臓病
vi: Bệnh Tim

source: High Cholesterol
ja: 高コレステロール
vi: Cholesterol Cao

source: Digestive Issues
ja: 消化器系の問題
vi: Vấn Đề Tiêu Hóa

source: Osteoporosis
ja: 骨粗鬆症
vi: Loãng Xương

source: Kidney Disease
ja: 腎臓病
vi: Bệnh Thận

source: Obesity
ja: 肥満
vi: Béo Phì

source: Anemia
ja: 貧血
vi: Thiếu Máu

source: Depression
ja: うつ病
vi: Trầm Cảm

source: Gout
ja: 痛風
vi: Bệnh Gout

source: Nutrition
ja: 栄養
vi: Dinh dưỡng

source: Protein
ja: タンパク質
vi: Chất đạm

source: Calories
ja: カロリー
vi: Calo

source: Carbohydrates
ja: 炭水化物
vi: Carbohydrate

source: Fat
ja: 脂肪
vi: Chất béo

source: Add to your nutrition
ja: 栄養に追加
vi: Thêm vào dinh dưỡng của bạn

# nutritionValue
source: Nutrition values
ja: 栄養価
vi: Giá trị dinh dưỡng

source: History
ja: 履歴
vi: Lịch sử

# awesomeEatThisFood
source: Awesome! I will eat this food
ja: すごい！この食べ物を食べます
vi: Tuyệt vời! Tôi sẽ ăn thực phẩm này

# thereNoThingHere
source: Oops... There's nothing here
ja: おっと... ここには何もありません
vi: Rất tiếc... Không có gì ở đây

# mealFromIngredient
source: Meal from ingredients
ja: 材料からの食事
vi: Bữa ăn từ nguyên liệu

# eatThisFoodALittle
source: I will eat this food a little
ja: 私はこの食べ物を少し食べます
vi: Tôi sẽ ăn một chút thức ăn này

# mustEatThisFood
source: I have to eat this food
ja: 私はこの食べ物を食べなければなりません
vi: Tôi phải ăn thức ăn này
